Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-GP_DFP/1.0.39/edc/PIC32MK0512GPD064.PIC
      <edc:DCRDef edc:_addr="0x1FC63FCC" edc:access="-n--------nnnnnnnnnn-n---nnnnnnn" edc:cname="BF2DEVCFG0" edc:default="0xffffffff" edc:desc="" edc:factorydefault="0xffffffff" edc:impl="0x403ff47b" edc:name="BF2DEVCFG0" edc:nzwidth="0x20" edc:unimplval="1" edc:unused="0x0" edc:useinchecksum="0x7FFFFFFF">
        <edc:DCRModeList>
          <edc:DCRMode edc:id="DS.0">
            <edc:DCRFieldDef edc:cname="DEBUG" edc:desc="Background Debugger Enable" edc:mask="0x3" edc:name="DEBUG" edc:nzwidth="2">
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="Debugger is enabled" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="Debugger is disabled" edc:when="(field &amp; 0x3) == 0x3"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="JTAGEN" edc:desc="JTAG Enable" edc:mask="0x1" edc:name="JTAGEN" edc:nzwidth="1">
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="JTAG Port Enabled" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="JTAG Disabled" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="ICESEL" edc:desc="ICE/ICD Comm Channel Select" edc:mask="0x3" edc:name="ICESEL" edc:nzwidth="2">
              <edc:DCRFieldSemantic edc:cname="ICS_PGx1" edc:desc="Communicate on PGEC1/PGED1" edc:when="(field &amp; 0x3) == 0x3"/>
              <edc:DCRFieldSemantic edc:cname="ICS_PGx2" edc:desc="Communicate on PGEC2/PGED2" edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:DCRFieldSemantic edc:cname="ICS_PGx3" edc:desc="Communicate on PGEC3/PGED3" edc:when="(field &amp; 0x3) == 0x1"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="TRCEN" edc:desc="Trace Enable" edc:mask="0x1" edc:name="TRCEN" edc:nzwidth="1">
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="Trace features in the CPU are enabled" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="Trace features in the CPU are disabled" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="BOOTISA" edc:desc="Boot ISA Selection" edc:mask="0x1" edc:name="BOOTISA" edc:nzwidth="1">
              <edc:DCRFieldSemantic edc:cname="MIPS32" edc:desc="Boot code and Exception code is MIPS32" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="MICROMIPS" edc:desc="Boot code and Exception code is microMIPS" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:DCRFieldDef edc:cname="FSLEEP" edc:desc="Flash Sleep Mode" edc:mask="0x1" edc:name="FSLEEP" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="VREGS" edc:desc="Flash power down is controlled by the VREGS bit" edc:when="(field &amp; 0x1) == 0x0"/>
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="Flash is powered down when the device is in Sleep mode" edc:when="(field &amp; 0x1) == 0x1"/>
            </edc:DCRFieldDef>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:DCRFieldDef edc:cname="DBGPER" edc:desc="Debug Mode CPU Access Permission" edc:mask="0x7" edc:name="DBGPER" edc:nzwidth="0x3">
              <edc:DCRFieldSemantic edc:cname="ALLOW_PG2" edc:desc="Allow CPU access to Permission Group 2 permission regions" edc:when="(field &amp; 0x7) == 0x4"/>
              <edc:DCRFieldSemantic edc:cname="ALLOW_PG1" edc:desc="Allow CPU access to Permission Group 1 permission regions" edc:when="(field &amp; 0x7) == 0x2"/>
              <edc:DCRFieldSemantic edc:cname="ALLOW_PG0" edc:desc="Allow CPU access to Permission Group 0 permission regions" edc:when="(field &amp; 0x7) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="PG_1_0" edc:desc="PG0: Allow PG1: Allow PG2: Deny" edc:when="(field &amp; 0x7) == 0x3"/>
              <edc:DCRFieldSemantic edc:cname="PG_2_0" edc:desc="PG0: Allow PG1: Deny PG2: Allow" edc:when="(field &amp; 0x7) == 0x5"/>
              <edc:DCRFieldSemantic edc:cname="PG_2_1" edc:desc="PG0: Deny PG1: Allow PG2: Allow" edc:when="(field &amp; 0x7) == 0x6"/>
              <edc:DCRFieldSemantic edc:cname="PG_ALL" edc:desc="Allow CPU access to all permission regions" edc:when="(field &amp; 0x7) == 0x7"/>
              <edc:DCRFieldSemantic edc:cname="PG_NONE" edc:desc="Deny CPU access to all permission regions" edc:when="(field &amp; 0x7) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="SMCLR" edc:desc="Soft Master Clear Enable" edc:mask="0x1" edc:name="SMCLR" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="MCLR_POR" edc:desc="MCLR pin generates an emulated POR Reset" edc:when="(field &amp; 0x1) == 0x0"/>
              <edc:DCRFieldSemantic edc:cname="MCLR_NORM" edc:desc="MCLR pin generates a normal system Reset" edc:when="(field &amp; 0x1) == 0x1"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="SOSCGAIN" edc:desc="Secondary Oscillator Gain Control bits" edc:mask="0x3" edc:name="SOSCGAIN" edc:nzwidth="0x2">
              <edc:DCRFieldSemantic edc:cname="GAIN_2X" edc:desc="2x gain setting" edc:when="(field &amp; 0x3) == 0x3"/>
              <edc:DCRFieldSemantic edc:cname="GAIN_1_5X" edc:desc="1.5x gain setting" edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:DCRFieldSemantic edc:cname="GAIN_0_5X" edc:desc="0.5x gain setting" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="GAIN_1X" edc:desc="1x gain setting" edc:when="(field &amp; 0x3) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="SOSCBOOST" edc:desc="Secondary Oscillator Boost Kick Start Enable bit" edc:mask="0x1" edc:name="SOSCBOOST" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="Boost the kick start of the oscillator" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="Normal start of the oscillator" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="POSCGAIN" edc:desc="Primary Oscillator Gain Control bits" edc:mask="0x3" edc:name="POSCGAIN" edc:nzwidth="0x2">
              <edc:DCRFieldSemantic edc:cname="GAIN_LEVEL_3" edc:desc="Gain Level 3 (highest)" edc:when="(field &amp; 0x3) == 0x3"/>
              <edc:DCRFieldSemantic edc:cname="GAIN_LEVEL_2" edc:desc="Gain Level 2" edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:DCRFieldSemantic edc:cname="GAIN_LEVEL_1" edc:desc="Gain Level 1" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="GAIN_LEVEL_0" edc:desc="Gain Level 0 (Lowest)" edc:when="(field &amp; 0x3) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="POSCBOOST" edc:desc="Primary Oscillator Boost Kick Start Enable bit" edc:mask="0x1" edc:name="POSCBOOST" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="Boost the kick start of the oscillator" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="Normal start of the oscillator" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:AdjustPoint edc:offset="8"/>
            <edc:DCRFieldDef edc:cname="EJTAGBEN" edc:desc="EJTAG Boot Enable" edc:mask="0x1" edc:name="EJTAGBEN" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="REDUCED" edc:desc="Reduced EJTAG functionality" edc:when="(field &amp; 0x1) == 0x0"/>
              <edc:DCRFieldSemantic edc:cname="NORMAL" edc:desc="Normal EJTAG functionality" edc:when="(field &amp; 0x1) == 0x1"/>
            </edc:DCRFieldDef>
          </edc:DCRMode>
        </edc:DCRModeList>
      </edc:DCRDef>
