Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-GP_DFP/1.0.39/edc/PIC32MK0512GPD064.PIC
      <edc:SFRDef edc:_addr="0x1F801230" edc:_begin="0x0" edc:_end="0x40" edc:_modsrc="DOS-02823_WACJ_clk_cru_upb_v2.Module" edc:_refcount="1" edc:access="--n--nnn-nnnnnnn-----nnn-----nnn" edc:cname="UPLLCON" edc:desc="" edc:impl="0x277f0707" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--u--001-xxxxxxx-----001-----xxx" edc:name="UPLLCON" edc:nzwidth="32" edc:por="--x--001-xxxxxxx-----001-----xxx" edc:portals="CLR SET INV" ltx:memberofperipheral="CRU">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="PLLRANGE" edc:desc="" edc:mask="0x7" edc:name="PLLRANGE" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="5"/>
            <edc:SFRFieldDef edc:cname="PLLIDIV" edc:desc="" edc:mask="0x7" edc:name="PLLIDIV" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="5"/>
            <edc:SFRFieldDef edc:cname="PLLMULT" edc:desc="" edc:mask="0x7f" edc:name="PLLMULT" edc:nzwidth="7"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="PLLODIV" edc:desc="" edc:mask="0x7" edc:name="PLLODIV" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="UPOSCEN" edc:mask="0x1" edc:name="UPOSCEN" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F801240" edc:_begin="0x50" edc:_end="0x90" edc:_modsrc="DOS-02823_WACJ_clk_cru_upb_v2.Module" edc:_refcount="2" edc:access="nn-------------------nn-nnnnnnnn" edc:cname="RCON" edc:desc="" edc:impl="0xc00006ff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00-------------------u0-00000000" edc:name="RCON" edc:nzwidth="32" edc:por="00-------------------x0-00000011" edc:portals="CLR SET INV" ltx:memberofperipheral="CRU">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="POR" edc:desc="" edc:mask="0x1" edc:name="POR" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="BOR" edc:desc="" edc:mask="0x1" edc:name="BOR" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="IDLE" edc:desc="" edc:mask="0x1" edc:name="IDLE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="SLEEP" edc:desc="" edc:mask="0x1" edc:name="SLEEP" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="WDTO" edc:desc="" edc:mask="0x1" edc:name="WDTO" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="DMTO" edc:desc="" edc:mask="0x1" edc:name="DMTO" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="SWR" edc:desc="" edc:mask="0x1" edc:name="SWR" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="EXTR" edc:desc="" edc:mask="0x1" edc:name="EXTR" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="CMR" edc:desc="" edc:mask="0x1" edc:name="CMR" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="DPSLP" edc:mask="0x1" edc:name="DPSLP" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x5"/>
            <edc:SFRFieldDef edc:cname="VBAT" edc:desc="" edc:mask="0x1" edc:name="VBAT" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="VBPOR" edc:mask="0x1" edc:name="VBPOR" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0xc"/>
            <edc:SFRFieldDef edc:cname="PORCORE" edc:mask="0x1" edc:name="PORCORE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PORIO" edc:mask="0x1" edc:name="PORIO" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F801250" edc:_begin="0x50" edc:_end="0x90" edc:_modsrc="DOS-02823_WACJ_clk_cru_upb_v2.Module" edc:_refcount="2" edc:access="-------------------------------w" edc:cname="RSWRST" edc:desc="" edc:impl="0x1" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-------------------------------0" edc:name="RSWRST" edc:nzwidth="32" edc:por="-------------------------------0" edc:portals="CLR SET INV" ltx:memberofperipheral="CRU">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="SWRST" edc:desc="" edc:mask="0x1" edc:name="SWRST" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="0x3"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F801260" edc:_begin="0x50" edc:_end="0x90" edc:_modsrc="DOS-02823_WACJ_clk_cru_upb_v2.Module" edc:_refcount="2" edc:access="------nnn---n-nnnnnnnnnnnnnnnnnn" edc:cname="RNMICON" edc:desc="" edc:impl="0x38bffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="------0u0---0-000000000000000000" edc:name="RNMICON" edc:nzwidth="32" edc:por="------0x0---0-000000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="CRU">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="NMICNT" edc:desc="" edc:mask="0xffff" edc:name="NMICNT" edc:nzwidth="16"/>
            <edc:SFRFieldDef edc:cname="WDTS" edc:desc="" edc:mask="0x1" edc:name="WDTS" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CF" edc:desc="" edc:mask="0x1" edc:name="CF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="HLVD" edc:desc="" edc:mask="0x1" edc:name="HLVD" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="GNMI" edc:mask="0x1" edc:name="GNMI" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="SWNMI" edc:desc="" edc:mask="0x1" edc:name="SWNMI" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="WDTO" edc:desc="" edc:mask="0x1" edc:name="WDTO" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="DMTO" edc:desc="" edc:mask="0x1" edc:name="DMTO" edc:nzwidth="1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F801270" edc:_begin="0x50" edc:_end="0x90" edc:_modsrc="DOS-02823_WACJ_clk_cru_upb_v2.Module" edc:_refcount="2" edc:access="------------------------nnnn---n" edc:cname="PWRCON" edc:desc="" edc:impl="0xf1" edc:isindirect="false" edc:isvolatile="true" edc:mclr="------------------------uuuu---0" edc:name="PWRCON" edc:nzwidth="32" edc:por="------------------------xxxx---0" edc:portals="CLR SET INV" ltx:memberofperipheral="CRU">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="VREGS" edc:desc="" edc:mask="0x1" edc:name="VREGS" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="VREGSLP" edc:mask="0x3" edc:name="VREGSLP" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="VREGRUN" edc:mask="0x3" edc:name="VREGRUN" edc:nzwidth="0x2"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F801280" edc:_begin="0x90" edc:_end="0xb0" edc:_modsrc="DOS-02823_WACJ_clk_cru_upb_v2.Module" edc:_refcount="3" edc:access="-nnnnnnnnnnnnnnnnnnnn-nr----nnnn" edc:cname="REFO1CON" edc:desc="" edc:impl="0x7ffffb0f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-00000000000000000000-00----0000" edc:name="REFO1CON" edc:nzwidth="32" edc:por="-00000000000000000000-00----0000" edc:portals="CLR SET INV" ltx:memberofperipheral="CRU">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="ROSEL" edc:desc="" edc:mask="0xf" edc:name="ROSEL" edc:nzwidth="4"/>
            <edc:AdjustPoint edc:offset="4"/>
            <edc:SFRFieldDef edc:cname="ACTIVE" edc:desc="" edc:mask="0x1" edc:name="ACTIVE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="DIVSWEN" edc:desc="" edc:mask="0x1" edc:name="DIVSWEN" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="RSLP" edc:desc="" edc:mask="0x1" edc:name="RSLP" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="OE" edc:desc="" edc:mask="0x1" edc:name="OE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="SIDL" edc:desc="" edc:mask="0x1" edc:name="SIDL" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="FRZ" edc:desc="" edc:ishidden="true" edc:islanghidden="true" edc:mask="0x1" edc:name="FRZ" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ON" edc:desc="" edc:mask="0x1" edc:name="ON" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="RODIV" edc:desc="" edc:mask="0x7fff" edc:name="RODIV" edc:nzwidth="15"/>
          </edc:SFRMode>
        </edc:SFRModeList>
        <edc:FreezeBit edc:freezeval="1" edc:name="REFERENCE CLOCK1" edc:pos="14"/>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F801290" edc:_begin="0x90" edc:_end="0xb0" edc:_modsrc="DOS-02823_WACJ_clk_cru_upb_v2.Module" edc:_refcount="3" edc:access="nnnnnnnnn-----------------------" edc:cname="REFO1TRIM" edc:desc="" edc:impl="0xff800000" edc:isindirect="false" edc:isvolatile="true" edc:mclr="000000000-----------------------" edc:name="REFO1TRIM" edc:nzwidth="32" edc:por="000000000-----------------------" edc:portals="CLR SET INV" ltx:memberofperipheral="CRU">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="23"/>
            <edc:SFRFieldDef edc:cname="ROTRIM" edc:desc="" edc:mask="0x1ff" edc:name="ROTRIM" edc:nzwidth="9"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
