Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-GP_DFP/1.0.39/edc/PIC32MK0512GPD064.PIC
      <edc:SFRDef edc:_addr="0x1F860270" edc:_begin="0x0" edc:_end="0xe0" edc:_modsrc="DOS-02467_gpio_ports_upb_v1.Module" edc:_refcount="3" edc:access="----------------n---n-----------" edc:cname="CNCONC" edc:desc="" edc:grp="PORTC" edc:impl="0xffff9fff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------0---0-----------" edc:name="CNCONC" edc:nzwidth="0x20" edc:por="----------------0---0-----------" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="0xb"/>
            <edc:SFRFieldDef edc:cname="EDGEDETECT" edc:mask="0x1" edc:name="EDGEDETECT" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="ON" edc:desc="" edc:mask="0x1" edc:name="ON" edc:nzwidth="0x1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
        <edc:FreezeBit edc:freezeval="1" edc:name="CHANGE NOTICE C" edc:pos="14"/>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F860280" edc:_begin="0x0" edc:_end="0xe0" edc:_modsrc="DOS-02467_gpio_ports_upb_v1.Module" edc:_refcount="3" edc:access="----------------nnnnnnnnnn---nnn" edc:cname="CNENC" edc:desc="" edc:grp="PORTC" edc:impl="0xffc0ffc7" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------0000000000---000" edc:name="CNENC" edc:nzwidth="0x20" edc:por="----------------0000000000---000" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CNIEC0" edc:desc="" edc:mask="0x1" edc:name="CNIEC0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIEC1" edc:desc="" edc:mask="0x1" edc:name="CNIEC1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIEC2" edc:desc="" edc:mask="0x1" edc:name="CNIEC2" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="CNIEC6" edc:desc="" edc:mask="0x1" edc:name="CNIEC6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIEC7" edc:desc="" edc:mask="0x1" edc:name="CNIEC7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIEC8" edc:desc="" edc:mask="0x1" edc:name="CNIEC8" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIEC9" edc:desc="" edc:mask="0x1" edc:name="CNIEC9" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIEC10" edc:desc="" edc:mask="0x1" edc:name="CNIEC10" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIEC11" edc:desc="" edc:mask="0x1" edc:name="CNIEC11" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIEC12" edc:desc="" edc:mask="0x1" edc:name="CNIEC12" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIEC13" edc:desc="" edc:mask="0x1" edc:name="CNIEC13" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIEC14" edc:desc="" edc:mask="0x1" edc:name="CNIEC14" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIEC15" edc:desc="" edc:mask="0x1" edc:name="CNIEC15" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F860290" edc:_begin="0x0" edc:_end="0xe0" edc:_modsrc="DOS-02467_gpio_ports_upb_v1.Module" edc:_refcount="3" edc:access="----------------nnnnnnnnnn---nnn" edc:cname="CNSTATC" edc:desc="" edc:grp="PORTC" edc:impl="0xffffffc7" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------0000000000---000" edc:name="CNSTATC" edc:nzwidth="0x20" edc:por="----------------0000000000---000" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CNSTATC0" edc:desc="" edc:mask="0x1" edc:name="CNSTATC0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATC1" edc:desc="" edc:mask="0x1" edc:name="CNSTATC1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATC2" edc:desc="" edc:mask="0x1" edc:name="CNSTATC2" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="CNSTATC6" edc:desc="" edc:mask="0x1" edc:name="CNSTATC6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATC7" edc:desc="" edc:mask="0x1" edc:name="CNSTATC7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATC8" edc:desc="" edc:mask="0x1" edc:name="CNSTATC8" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATC9" edc:desc="" edc:mask="0x1" edc:name="CNSTATC9" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATC10" edc:desc="" edc:mask="0x1" edc:name="CNSTATC10" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATC11" edc:desc="" edc:mask="0x1" edc:name="CNSTATC11" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATC12" edc:desc="" edc:mask="0x1" edc:name="CNSTATC12" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATC13" edc:desc="" edc:mask="0x1" edc:name="CNSTATC13" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATC14" edc:desc="" edc:mask="0x1" edc:name="CNSTATC14" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATC15" edc:desc="" edc:mask="0x1" edc:name="CNSTATC15" edc:nzwidth="0x1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8602A0" edc:_begin="0x0" edc:_end="0xe0" edc:_modsrc="DOS-02467_gpio_ports_upb_v1.Module" edc:_refcount="3" edc:access="----------------nnnnnnnnnn---nnn" edc:cname="CNNEC" edc:desc="" edc:impl="0xffc7" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------0000000000---000" edc:name="CNNEC" edc:nzwidth="32" edc:por="----------------0000000000---000" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CNNEC0" edc:mask="0x1" edc:name="CNNEC0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNNEC1" edc:mask="0x1" edc:name="CNNEC1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNNEC2" edc:mask="0x1" edc:name="CNNEC2" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="CNNEC6" edc:mask="0x1" edc:name="CNNEC6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNNEC7" edc:mask="0x1" edc:name="CNNEC7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNNEC8" edc:mask="0x1" edc:name="CNNEC8" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNNEC9" edc:mask="0x1" edc:name="CNNEC9" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNNEC10" edc:mask="0x1" edc:name="CNNEC10" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNNEC11" edc:mask="0x1" edc:name="CNNEC11" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNNEC12" edc:mask="0x1" edc:name="CNNEC12" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNNEC13" edc:mask="0x1" edc:name="CNNEC13" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNNEC14" edc:mask="0x1" edc:name="CNNEC14" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNNEC15" edc:mask="0x1" edc:name="CNNEC15" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8602B0" edc:_begin="0x0" edc:_end="0xe0" edc:_modsrc="DOS-02467_gpio_ports_upb_v1.Module" edc:_refcount="3" edc:access="----------------nnnnnnnnnn---nnn" edc:cname="CNFC" edc:desc="" edc:impl="0xffc7" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------0000000000---000" edc:name="CNFC" edc:nzwidth="32" edc:por="----------------0000000000---000" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CNFC0" edc:mask="0x1" edc:name="CNFC0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNFC1" edc:mask="0x1" edc:name="CNFC1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNFC2" edc:mask="0x1" edc:name="CNFC2" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="CNFC6" edc:mask="0x1" edc:name="CNFC6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNFC7" edc:mask="0x1" edc:name="CNFC7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNFC8" edc:mask="0x1" edc:name="CNFC8" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNFC9" edc:mask="0x1" edc:name="CNFC9" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNFC10" edc:mask="0x1" edc:name="CNFC10" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNFC11" edc:mask="0x1" edc:name="CNFC11" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNFC12" edc:mask="0x1" edc:name="CNFC12" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNFC13" edc:mask="0x1" edc:name="CNFC13" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNFC14" edc:mask="0x1" edc:name="CNFC14" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNFC15" edc:mask="0x1" edc:name="CNFC15" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8602C0" edc:_begin="0x0" edc:_end="0xe0" edc:_modsrc="DOS-02467_gpio_ports_upb_v1.Module" edc:_refcount="3" edc:access="----------------n---n-nnnn------" edc:cname="SRCON0C" edc:desc="" edc:impl="0x8bc0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------0---0-0000------" edc:name="SRCON0C" edc:nzwidth="32" edc:por="----------------0---0-0000------" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="SR0C6" edc:mask="0x1" edc:name="SR0C6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SR0C7" edc:mask="0x1" edc:name="SR0C7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SR0C8" edc:mask="0x1" edc:name="SR0C8" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SR0C9" edc:mask="0x1" edc:name="SR0C9" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="SR0C11" edc:mask="0x1" edc:name="SR0C11" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="SR0C15" edc:mask="0x1" edc:name="SR0C15" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
